app/views/static_page/home.html.erb

    <ul>
      <% idol.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."idol_id" = ?  [["idol_id", 1]]