app/controllers/idols_controller.rb

SELECT "idols".* FROM "idols"
---
  def index
    @idols = Idol.all

INSERT INTO "idols" ("about", "contact", "count", "created_at", "motto", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @idol = Idol.new(idol_params)
    @idol.count = 0

    respond_to do |format|
      if @idol.save

SELECT "idols".* FROM "idols" WHERE "idols"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_idol
      @idol = Idol.find(params[:id])