app/controllers/static_page_controller.rb

  def home

    @idols = Idol.find(:all, :order => "count DESC")

    if @idols.length > 0
---
SELECT "idols".* FROM "idols" ORDER BY count DESC